Tester/src/InformationRegisters/Log/Log.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Log</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Application</name>
    <type>
      <types>CatalogRef.Applications</types>
    </type>
  </resources>
  <resources>
    <name>Area</name>
    <type>
      <types>CatalogRef.Areas</types>
    </type>
  </resources>
  <resources>
    <name>Duration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Error</name>
    <type>
      <types>CatalogRef.ErrorLog</types>
    </type>
  </resources>
  <resources>
    <name>Job</name>
    <type>
      <types>DocumentRef.Job</types>
    </type>
  </resources>
  <resources>
    <name>Level</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Row</name>
    <type>
      <types>DefinedType.LineNumber</types>
    </type>
  </resources>
  <resources>
    <name>Source</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </resources>
  <resources>
    <name>Started</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.Statuses</types>
    </type>
  </resources>
  <dimensions>
    <name>Session</name>
    <type>
      <types>CatalogRef.Sessions</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Versions</types>
      <types>CatalogRef.Scenarios</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/InformationRegisters/Log/Forms/List/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	setFilter ();
	AppearanceSrv.Read ( ThisObject );
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure loadParams ()
	
	ScenarioFilter = Parameters.Scenario;
	JobFilter = Parameters.Job;
	
EndProcedure 

&AtServer
Procedure setFilter ()
	
	defaultFilter = true;
	if ( not JobFilter.IsEmpty () ) then
		defaultFilter = false;
		filterByJob ();
	endif;
	if ( ScenarioFilter <> undefined ) then
		defaultFilter = false;
		filterByScenario ();
	endif;
	if ( defaultFilter ) then
		UserFilter = SessionParameters.User;
		filterByUser ();
	endif;
	
EndProcedure 

&AtServer
Procedure filterByJob ()
	
	DC.ChangeFilter ( List, "Job", JobFilter, not JobFilter.IsEmpty () );
	
EndProcedure 

&AtServer
Procedure filterByUser ()
	
	DC.ChangeFilter ( List, "User", UserFilter, not UserFilter.IsEmpty () );
	
EndProcedure 

&AtServer
Procedure filterByScenario ()
	
	DC.ChangeFilter ( List, "Scenario", ScenarioFilter, ScenarioFilter <> undefined );
	Appearance.Apply ( ThisObject, "ScenarioFilter" );
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure UserFilterOnChange ( Item )
	
	applyUserFilter ();
	
EndProcedure

&AtServer
Procedure applyUserFilter ()
	
	if ( not UserFilter.IsEmpty () ) then
		JobFilter = undefined;
		filterByJob ();
		Appearance.Apply ( ThisObject, "JobFilter" );
	endif;
	filterByUser ();
	Appearance.Apply ( ThisObject, "UserFilter" );

EndProcedure

&AtClient
Procedure SeverityFilterOnChange ( Item )
	
	filterBySeverity ();
	
EndProcedure

&AtServer
Procedure filterBySeverity ()
	
	DC.ChangeFilter ( List, "Severity", SeverityFilter, not SeverityFilter.IsEmpty () );
	Appearance.Apply ( ThisObject, "SeverityFilter" );
	
EndProcedure 

&AtClient
Procedure AreaFilterOnChange ( Item )
	
	filterByArea ();
	
EndProcedure

&AtServer
Procedure filterByArea ()
	
	DC.ChangeFilter ( List, "Area", AreaFilter, not AreaFilter.IsEmpty () );
	Appearance.Apply ( ThisObject, "AreaFilter" );
	
EndProcedure 

&AtClient
Procedure ScenarioFilterOnChange ( Item )
	
	filterByScenario ();
	
EndProcedure

&AtClient
Procedure JobFilterOnChange ( Item )
	
	applyJobFilter ();
	
EndProcedure

&AtServer
Procedure applyJobFilter ()
	
	if ( not JobFilter.IsEmpty () ) then
		UserFilter = undefined;
		filterByUser ();
		Appearance.Apply ( ThisObject, "UserFilter" );
	endif;
	filterByJob ();
	Appearance.Apply ( ThisObject, "JobFilter" );

EndProcedure

&AtClient
Procedure ListSelection ( Item, SelectedRow, Field, StandardProcessing )
	
	if ( openError ( Field )
		or showError ()
		or openJob ( Field ) ) then
		StandardProcessing = false;
	endif; 
	
EndProcedure

&AtClient
Function openError ( Field )
	
	if ( Field.Name = "Error" ) then
		ShowValue ( , Items.List.CurrentData.Error );
		return true;
	endif; 
	return false;
	
EndFunction 

&AtClient
Function showError ()
	
	error = Items.List.CurrentData.Error;
	if ( error.IsEmpty ()
		or not DF.Pick ( error, "ScreenshotExists" ) ) then
		return false;
	else
		p = new Structure ();
		p.Insert ( "Title", error );
		p.Insert ( "URL", GetURL ( error, "Screenshot" ) );
		OpenForm ( "CommonForm.Screenshot", p );
		return true;
	endif; 
	
EndFunction

&AtClient
Function openJob ( Field )
	
	if ( Field.Name = "Job" ) then
		ShowValue ( , Items.List.CurrentData.Job );
		return true;
	endif; 
	return false;
	
EndFunction
